Repository: msp1015/TFG-Semi-Supervised-Learning
Catalog: web/app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Graphs
es: Grafos

source: English
es: Inglés

source: Spanish
es: Español

source: Please log in to access this page.
es: Por favor, inicia sesión para acceder a esta página.

source: Internal Server Error
es: Error interno del servidor

source: Not found
es: No encontrado

source: Forbidden
es: Petición denegada por el servidor

source: Unauthorized
es: No autorizado

source: Bad request
es: Mala petición

source: You must upload a file
es: Debe subir un archivo

source: File must be ARFF or CSV
es: El fichero debe ser ARFF o CSV

source: Name
es: Nombre

source: Email
es: Correo electrónico

source: Password
es: Contraseña

source: Confirm password
es: Confirmar contraseña

source: Current password
es: Contraseña actual

source: New password
es: Nueva contraseña

source: Select the target/class attribute of the dataset
es: Selecciona el atributo de la clase/etiqueta del conjunto de datos

source: Unlabelled percentage
es: Porcentaje de no etiquetados

source: Select X component
es: Selecciona la componente X

source: Select Y component
es: Selecciona la componente Y

source: Use PCA to reduce to 2D
es: Utilizar PCA para reducir a 2D

source: Standardize
es: Estandarizar

source: Test percentage (after unlabelled percentage)
es: Porcentaje de test (después de aplicar el no etiquetados)

source: Select classifier
es: Selecciona clasificador

source: N (Number of instances to select in each iteration)
es: N (Número de datos a seleccionar en cada iteración)

source: Threshold
es: Límite

source: Number of iterations
es: Número de iteraciones

source: Positives
es: Positivos

source: Negatives
es: Negativos

source: Number of initial data
es: Número de datos iniciales

source: Number of trees
es: Número de árboles

source: Select constructor
es: Selecciona un constructor

source: Select inference
es: Selecciona la inferencia

source: You must select an algorithm
es: Debe seleccionar un algoritmo

source: Come back soon!
es: ¡Vuelve pronto!

source: You are already logged in!
es: ¡Ya has iniciado sesión!

source: Logging successful!
es: ¡Inicio de sesión correcto!

source: Incorrect password
es: Contraseña incorrecta

source: Email not found
es: Correo electrónico no encontrado

source: You are already registered!
es: ¡Ya estás registrado!

source: Email already exists
es: El correo electrónico ya existe

source: Could not create account!
es: La cuenta no pudo ser creada

source: Account created!
es: ¡Cuenta creada!

source: User doesn't exist
es: El usuario no existe

source: Incorrect current password
es: Contraseña actual incorrecta

source: Account updated!
es: ¡Cuenta actualizada!

source: You must select the parameters of the algorithm
es: Debe seleccionar los parámetros del algoritmo

source: Classifiers must be different (diverse) to ensure proper execution
es: Los clasificadores deben ser diferentes (diversos) para asegurar una ejecución correcta

source: Admin dashboard
es: Panel de administración

source: My Space
es: Mi Espacio

source: Profile
es: Perfil

source: Log Out
es: Cerrar sesión

source: Sign Up
es: Registrarse

source: Login
es: Iniciar sesión

source: Success
es: Éxito

source: Warning
es: Advertencia

source: just now
es: justo ahora

source: Go home
es: Ir al inicio

source: Home
es: Inicio

source: Semi-Supervised Algorithm Visualizer
es: Visualizador de Algoritmos Semi-Supervisados

source: A little bit of theory...
es: Un poco de teoría...

source: Objective
es: Objetivo

source: The aim of this tool is to facilitate, through visualizations, the understanding of how the main semi-supervised algorithms actually work when combined with theoretical concepts. <br /><br />By selecting any of the algorithms, you will be redirected to load the dataset. Subsequently, you can configure the algorithm with the desired parameters and finally obtain a visualization of the training process.
es: El objetivo de esta herramienta es facilitar, mediante visualizaciones, la comprensión de cómo funcionan realmente los principales algoritmos semi-supervisados cuando se compagina con los conceptos teóricos. <br><br>Al seleccionar cualquiera de los algoritmos, será redireccionado a la carga del conjunto de datos. Posteriormente, podrá configurar el algoritmo con los parámetros deseados y finalmente obtener una visualización del entrenamiento.

source: Construct similarity graphs to represent sample similarities, then use these graphs to propagate labels from labeled to unlabeled data.
es: Construye grafos no dirigidos para representar los enlaces entre muestras y luego usarlos para propagar etiquetas desde los datos etiquetados.

source: Select
es: Seleccionar

source: Paper
es: Artículo

source: Ensemble that uses multiple decision trees to iteratively add confident predictions to the training set, enhancing mutual learning.
es: Multiclasificador con árboles de decisión para añadir iterativamente predicciones confiables al conjunto de entrenamiento, mejorando el aprendizaje mutuo.

source: Uses a base classifier initially trained with labeled data and iteratively retrains with pseudo-labeled data until a stopping criterion is met.
es: Utiliza un clasificador inicialmente entrenado con datos etiquetados y se reentrena con datos pseudo-etiquetados hasta cumplir un criterio de parada.

source: Uses two classifiers trained on different attribute subsets, iteratively predicting and selecting confident labels to build new training sets.
es: Usa dos clasificadores entrenados con diferentes subconjuntos de atributos, trabajando iterativamente para construir nuevos datos de entrenamiento.

source: Uses three classifiers to pseudo-label data, requiring two of them to agree, and iterates (with new empty data) until no new labels are added.
es: Utiliza tres clasificadores para pseudo-etiquetar datos, requiriendo que dos de ellos estén de acuerdo, e itera hasta que no se añadan nuevas etiquetas.

source: Uses multiple classifiers to pseudo-label data by majority vote, retraining misclassified instances until accuracy stops improving.
es: Utiliza varios clasificadores para pseudo-etiquetar datos por voto mayoritario, reentrenando malas instancias hasta que deje de mejorar.

source: Welcome
es: Bienvenido/a

source: Welcome to VASS! This is a basic tutorial.
es: ¡Bienvenido/a a Vass! Esto es un tutorial básico.

source: Here's a quick rundown of some theoretical concepts and what the app aims to do.
es: Aquí se realiza una pequeña introducción de conceptos teóricos y del objetivo de la aplicación.

source: By selecting any of these algorithms, you'll be able to upload a dataset to work with.
es: Al seleccionar cualquiera de estos algoritmos podrás subir un conjunto de datos con el que trabajar.

source: You can also access the paper that describes the algorithm.
es: También puedes acceder al artículo que describe el algoritmo.

source: Likewise, you can select any algorithm using these selectors.
es: Del mismo modo, puede seleccionar cualquier algoritmo mediante estos selectores.

source: On every page of the application, you'll always find a basic tutorial by clicking on this button.
es: En todas las páginas de la aplicación siempre encontrarás un tutorial básico pulsando en este botón.

source: At any time, you can refer to the application's guide by clicking on this button.
es: En cualquier momento puedes consultar el manual de la aplicación en este botón.

source: You can also choose the desired language.
es: También puedes elegir el idioma deseado.

source: You can log in or register in the application. This will allow you to store datasets and even save executions.
es: Puedes iniciar sesión o registrarte en la aplicación. Esto permitirá almacenar conjuntos de datos e incluso guardar ejecuciones.

source: Here you can access the profile and personal space with datasets and executions.
es: Aquí podrás acceder al perfil y al espacio personal con los conjuntos de datos y ejecuciones.

source: Next
es: Siguiente

source: Previous
es: Anterior

source: Done
es: Hecho

source: Uncheck PCA to select specific components
es: Desmarca PCA para seleccionar componentes específicas

source: If already semi-supervised, it will be ignored
es: Si ya fuera semi-supervisado, será ignorado

source: Input conditions
es: Condiciones de entrada

source: Allowed extensions: .CSV & .ARFF
es: Extensiones permitidas: .CSV & .ARFF

source: All attributes must be numeric
es: Todos los atributos deben ser numéricos

source: This does not include the target attribute (it can be categorical)
es: Esto no incluye al atributo de la clase (este puede ser categórico)

source: Supervised datasets can be uploaded
es: Se pueden cargar conjuntos de datos supervisados

source: With all examples labelled
es: Con todos los datos etiquetados

source: Semi-supervised datasets can be uploaded
es: Se pueden cargar conjuntos de datos semi-supervisados

source: Examples with -1, -1.0 or "?" on the target attribute will be interpreted as unlabelled examples
es: Los ejemplos con -1, 1.0 o "?" en el atributo de la clase serán interpretados como ejemplos no etiquetados

source: A dataset can contain multiple unlabelled examples, but with the same type (-1, -1.0 or "?")
es: Un conjunto de datos puede contener múltiples ejemplos no etiquetados, pero con el mismo tipo (-1, -1.0 o "?")

source: Close
es: Cerrar

source: Uploaded datasets
es: Conjunto de datos subidos

source: Dataset file
es: Fichero del conjunto de datos

source: Upload date
es: Fecha de subida

source: User
es: Usuario

source: Actions
es: Acciones

source: Run history
es: Historial de ejecuciones

source: Algorithm
es: Algoritmo

source: Run date
es: Fecha de ejecución

source: Parameters
es: Parámetros

source: Users
es: Usuarios

source: Last login
es: Último inicio de sesión

source: Are you sure?
es: ¿Estás seguro?

source: You are about to delete:
es: Vas a eliminar:

source: Cancel
es: Cancelar

source: Delete
es: Eliminar

source: Select algorithm
es: Selecciona un algoritmo

source: An error occurred
es: Ha ocurrido un error

source: Dataset upload
es: Carga del conjunto de datos

source: Go back
es: Volver

source: Conditions
es: Condiciones

source: File selection
es: Selección de fichero

source: Drag and drop your file
es: Arrastra y suelta tu archivo

source: or
es: o

source: Choose file
es: Selecciona fichero

source: completed
es: completado

source: Set test file
es: Usa un fichero de prueba

source: Previous file detected:
es: Fichero previo detectado:

source: Configure algorithm
es: Configurar algoritmo

source: It seems that something is wrong with the file, remember that it has to be a CSV or an ARFF. You should also review its content and format.
es: Parece que algo va mal con el archivo, recuerda que tiene que ser un CSV o un ARFF. También debes revisar su contenido y formato.

source: Data upload
es: Carga de datos

source: On this page, you can upload a dataset to test the algorithm. You can follow along with this tutorial while doing the process.
es: En esta página puedes cargar un conjunto de datos con el que probar el algoritmo. Puedes realizar el proceso a la vez que este tutorial.

source: It's important that the dataset meets certain conditions.
es: Es importante que el conjunto de datos cumpla una serie de condiciones.

source: If you don't have a dataset available, you can select this example one (Iris).
es: Si no dispones de un conjunto de datos, puedes seleccionar este de ejemplo (Iris).

source: You can also choose between other examples.
es: También puedes elegir entre otros ejemplos.

source: If you have one, you can drag and drop it or select it from your file system.
es: Si dispones de uno, puedes arrastrar o seleccionarlo desde tu sistema de archivos.

source: Once loaded, you can proceed to configure the algorithm
es: Una vez cargado podrás pasar a la configuración del algoritmo

source: Here you can see the content of the file you uploaded. If you see the data correctly, you can proceed to configure the algorithm.
es: Aquí puedes ver el contenido del archivo subido. Si ves correctamente los datos, puedes continuar con la configuración del algoritmo.

source: Algorithm configuration
es: Configuración del algoritmo

source: Dataset
es: Conjunto de datos

source: Theory
es: Teoría

source: Run
es: Ejecutar

source: Configuration area
es: Área de configuración

source: On this page, you'll be able to customize the parameters of algorithm
es: En esta página podrás personalizar los parámetros del algoritmo.

source: You can gain a deeper understanding of the algorithm by reviewing its theory and pseudocode.
es: Puedes conocer el algoritmo con mayor profundidad viendo su teoría y pseudocódigo.

source: Here you can select the desired parameters.
es: Aquí puedes seleccionar los parámetros deseados.

source: It's crucial to select the column of data that acts as the target correctly. The rest of the parameters can be used as default.
es: Es muy importante seleccionar correctamente la columna de los datos que actúa como objetivo. El resto de parámetros pueden servir por defecto.

source: And finally, execute the algorithm. The application may take a few seconds to display the complete execution.
es: Y finalmente ejecutar el algoritmo. La aplicación puede tardar unos segundos en mostrar la ejecución completa.

source: Decision Tree parameters
es: Parámetros de árboles de decisión

source: This technique is based on the idea of using multiple classifiers (decision trees, in this case), which are iteratively trained with an initial set of labeled data. As the algorithm progresses, each tree attempts to classify the unlabeled data, and the most confident predictions are added to the training set as if they were real labels. This process of "mutual teaching" among the classifiers progressively improves the model`s performance as more information from the unlabeled data is incorporated. Co-forest leverages the diversity among the decision trees to enhance the model`s generalization to new or unknown data, making it especially useful in scenarios where labels are scarce or expensive to obtain.
es: Esta técnica se basa en la idea de utilizar múltiples clasificadores (árboles de decisión, en este caso), los cuales se entrenan de forma iterativa con un conjunto inicial de datos etiquetados. A medida que el algoritmo avanza, cada árbol intenta clasificar los datos no etiquetados y las predicciones más confiables se añaden al conjunto de entrenamiento como si fueran etiquetas reales. Este proceso de "enseñanza mutua" entre los clasificadores permite mejorar progresivamente el rendimiento del modelo a medida que se incorpora más información de los datos no etiquetados. Co-forest aprovecha la diversidad entre los árboles de decisión para mejorar la generalización del modelo frente a datos nuevos o desconocidos, haciéndolo especialmente útil en escenarios donde las etiquetas son escasas o costosas de obtener.

source: /pseudocodigos/en/CoForest.png
es: /pseudocodigos/es/CoForest.png

source: Co-Forest Pseudocode
es: Pseudocódigo de Co-Forest

source: If it is larger than the total, it will be limited to it (the total)
es: Si es mayor que el total, se limitará a él (al total)

source: Enter 0 to not limit the number of iterations
es: Introduce 0 para no limitar el número de iteraciones

source: Strongly based on Self-Training but in this case, several classifiers (usually two) handle the process and "interact" with each other. As Self-Training, once classifiers are trained, they predict the labels of the those unlabelled instances, and all classifiers add the best predictions. Co-Training works with two views of the data ("multi-view"). These views correspond not to subsets of instances, but to subsets of instance´s atributtes (characteristics). Each classifier will train considering different characteristics. Ideally, these views are independent and can predict the label on their own (although this doesn´t always happen). When classifiers predict labels on the data, they select the most confident data of both and build the new training set for the next iteration.
es: Basado fuertemente en Self-Training, en este caso varios clasificadores (normalmente dos) se encargan del proceso e "interactúan" entre sí. Del mismo modo, una vez entrenados, predicen las etiquetas de los no clasificados y todos los clasificadores añaden las mejores predicciones. Co-Training trabaja con dos vistas sobre los datos ("multi-view"). Estas vistas corresponden no con subconjuntos de las instancias, sino de subconjuntos de las características de las mismas. Es decir, cada clasificador va a entrenarse teniendo en cuenta características distintas. Idealmente, estas vistas son independientes y pueden predecir por sí solas la etiqueta (aunque no siempre se cumplirá). Cuando los clasificadores predicen etiquetas sobre los datos, se seleccionan de ambos los de mayor confianza y construyen el nuevo conjunto de entrenamiento para la siguiente iteración.

source: /pseudocodigos/en/CoTraining.png
es: /pseudocodigos/es/CoTraining.png

source: Co-Training Pseudocode
es: Pseudocódigo de Co-Training

source: Democratic Co-Learning is a semi-supervised learning algorithm along the lines of Co-Training (various classifiers). The substantial difference is that they do not work with two (or more) set of attributes, in this case there is only one set of attributes ("single-view"). Starting with the labelled data, several classifiers do a weighted voting over those not labelled. That means that, for an instance, its new label will be the one voted by the majority. Furthermore, for those classifiers that do not vote as the majority, the instance (with the majority label) is added to their training set. This forces those misclassified classifiers to learn it in the next iteration. The entire process is repeated until no more instances are added to any training set, this is achieved when the accuracy does not improve despite the addition of new pseudo-labelled instances.
es: Democratic Co-Learning es un algoritmo de aprendizaje semi-supervisado en la línea de Co-Training (varios clasificadores). La diferencia sustancial es que no trabajan con dos (o más) conjuntos de atributos (para que cada clasificador utilice uno de ellos), en este caso solo se tiene un único conjunto de atributos ("single-view"). Partiendo de los datos etiquetados, varios clasificadores realizan votación ponderada sobre los no etiquetados. Lo que quiere decir que, para una instancia, su nueva etiqueta será la que vote la mayoría. Además, para aquellos clasificadores que no votan como la mayoría, la instancia se añade a su conjunto de entrenamiento junto a la etiqueta mayoritaria, de esta forma se "obliga" en la siguiente iteración a "aprenderla". Todo el proceso se repite hasta que no se añadan más instancias a ningún conjunto de entrenamiento, esto se alcanza cuando no se mejora la precisión pese a la adición de nuevas instancias pseudoetiquetadas.

source: /pseudocodigos/en/DemocraticCoLearningFit.png
es: /pseudocodigos/es/DemocraticCoLearningEntrenar.png

source: Democratic Co-Learning Fit Pseudocode
es: Pseudocódigo del Entrenamiento de Democratic Co-Learning

source: /pseudocodigos/en/DemocraticCoLearningCombine.png
es: /pseudocodigos/es/DemocraticCoLearningCombinar.png

source: Democratic Co-Learning Combine Pseudocode
es: Pseudocódigo de la Combinación de Democratic Co-Learning

source: Graph construction
es: Construcción del grafo

source: Inference
es: Inferencia

source: The GBILI algorithm, standing for Graph Building based on the Informativeness of Labeled Instances, is a graph construction method for semi-supervised learning that leverages the informativeness of labeled instances to establish strategic node connections. The process initiates with the creation of a distance matrix using Euclidean distance to identify k-nearest neighbors. After setting parameters such as the number of neighbors, k, each node`s mutual nearest neighbors are pinpointed. Informativeness is then calculated by summing distances from each node to its mutual neighbors and to the nearest labeled point, which helps in forming connections that minimize this distance sum. The graph is further refined by connecting isolated components through a Breadth-First Search, ensuring network connectivity without over-densifying, which is key to the transductive methods used in semi-supervised learning.
es: El algoritmo GBILI, que significa Construcción de Grafos basados en la Informatividad de Instancias Etiquetadas, es un método de construcción de grafos para aprendizaje semi-supervisado que aprovecha la informatividad de las instancias etiquetadas para establecer conexiones estratégicas de nodos. El proceso se inicia con la creación de una matriz de distancias utilizando la distancia Euclidiana para identificar los k vecinos más cercanos. Después de establecer parámetros como el número de vecinos, k, se identifican los vecinos mutuos más cercanos de cada nodo. La informatividad se calcula sumando las distancias de cada nodo a sus vecinos mutuos y al punto etiquetado más cercano, lo cual ayuda a formar conexiones que minimizan esta suma de distancias. El grafo se refina aún más conectando componentes aislados a través de una Búsqueda en Anchura (BFS), asegurando la conectividad de la red sin sobre-densificar, lo cual es clave para los métodos transductivos utilizados en el aprendizaje semi- supervisado.

source: /pseudocodigos/en/gbili.png
es: /pseudocodigos/es/gbili.png

source: The RGCLI (Robust Graph Construction that Considers Labeled Instances) algorithm enhances semi-supervised learning by efficiently constructing graphs in large datasets. It operates under the assumption that nearby or structurally similar points share the same label. The algorithm utilizes two parameters: ke for the broader neighborhood and ki for establishing actual connections based on proximity to labeled vertices. RGCLI begins by identifying ke nearest neighbors using a Kd-tree, calculates a score based on distances from a point to a mutual neighbor and the nearest labeled vertex, and then connects each point to ki mutual neighbors that minimize this distance. This approach ensures a sparse, meaningful graph that adheres to semi-supervised learning`s consistency assumptions while facilitating effective label propagation.
es: El algoritmo RGCLI (Construcción Robusta de Grafos que Considera Instancias Etiquetadas) mejora el aprendizaje semi-supervisado al construir grafos de manera eficiente en grandes conjuntos de datos. Opera bajo la suposición de que los puntos cercanos o estructuralmente similares comparten la misma etiqueta. El algoritmo utiliza dos parámetros: ke para el vecindario más amplio y ki para establecer conexiones reales basadas en la proximidad a los vértices etiquetados. RGCLI comienza identificando los ke vecinos más cercanos usando un Kd-tree, calcula una puntuación basada en las distancias desde un punto hasta un vecino mutuo y el vértice etiquetado más cercano, y luego conecta cada punto con ki vecinos mutuos que minimicen esta distancia. Este enfoque asegura un grafo escaso y significativo que se adhiere a las suposiciones de consistencia del aprendizaje semi-supervisado mientras facilita una efectiva propagación de etiquetas.

source: /pseudocodigos/en/rgcli.png
es: /pseudocodigos/es/rgcli.png
