Repository: msp1015/TFG-Semi-Supervised-Learning
Catalog: web/app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: The Graph-based Local and Global Consistency (LGC) algorithm is a semi-supervised learning method designed toference-tab"> predict labels for unlabeled data points by leveraging relationships within the data. The algorithm starts by creating an affinity matrix that represents the closeness between points based on their distances. This matrix is normalized to help stabilize the label propagation process. LGC iterates a label spreading mechanism where each data point updates its label based on the labels of its neighbors and its original label, balanced by a parameter. The process continues until the labels stabilize, essentially allowing each point to adopt the label most common among its neighbors. In this specific adaptation of LGC, the affinity matrix simplifies connections between points as either existing (1) or not (0), streamlining the computation. This approach effectively uses both labeled and unlabeled data to enhance label prediction, making it particularly useful in scenarios where labeled data is scarce but unlabeled data is plentiful.
es: El algoritmo de Consistencia Local y Global Basada en Grafos (LGC) es un método de aprendizaje semi-supervisado diseñado para predecir etiquetas para puntos de datos no etiquetados aprovechando las relaciones dentro de los datos. El algoritmo comienza creando una matriz de afinidad que representa la cercanía entre los puntos basada en sus distancias. Esta matriz se normaliza para ayudar a estabilizar el proceso de propagación de etiquetas. LGC itera un mecanismo de propagación de etiquetas donde cada punto de datos actualiza su etiqueta en función de las etiquetas de sus vecinos y su etiqueta original, balanceado por un parámetro. El proceso continúa hasta que las etiquetas se estabilizan, permitiendo esencialmente que cada punto adopte la etiqueta más común entre sus vecinos. En esta adaptación específica de LGC, la matriz de afinidad simplifica las conexiones entre puntos como existentes (1) o no (0), agilizando la computación. Este enfoque utiliza eficazmente tanto datos etiquetados como no etiquetados para mejorar la predicción de etiquetas, haciéndolo particularmente útil en escenarios donde los datos etiquetados son escasos pero los datos no etiquetados son abundantes.

source: /pseudocodigos/en/LGC.png
es: /pseudocodigos/es/LGC.png

source: If already semi-supervised, it will be ignored
es: Si ya fuera semi-supervisado, será ignorado

source: On this page, you'll be able to customize the parameters of graphs algorithms
es: En esta página podrás personalizar los parámetros de los grafos.

source: Here you can switch between the graph construction and inference theory.
es: Aquí puedes cambiar entre la teoría de la construcción de grafos y la de inferencia.

source: Empty N parameter to activate it
es: Vacía el parámetro N para activarlo

source: It is the simplest semi-supervised learning method. This method wraps a single base classifier, which is train with initial labelled data and take advantage of the pseudo-labelling process to continue its training. This method starts by training that base classifier with the labelled data. From this initial learning, the unlabelled data is labelled (pseudo-labelling). The most confident new labelled instances (in which the classifier has the most confident) are selected. Once selected, the classifier is retrained with union of those already labelled instances and these new labelled. The process continues until a stopping criterion (usually until label all data or a maximum number of iterations).
es: Se trata del método de aprendizaje semi-supervisado más sencillo y "directo". Este método "envuelve" un único clasificador base, que entrena con los datos etiquetados iniciales y aprovecha el proceso de pseudo etiquetado para continuar su entrenamiento. El método comienza por entrenar ese clasificador con los datos etiquetados que se tienen. A partir de este aprendizaje inicial, se etiqueta el resto de datos. De todas las nuevas predicciones se seleccionan aquellas en las que el clasificador más confianza tiene (de haber acertado). Una vez seleccionados, el clasificador es reentrenado con la unión de los ya etiquetados y estos nuevos. El proceso continúa hasta un criterio de parada (generalmente hasta etiquetar todos los datos o un número máximo de iteraciones).

source: /pseudocodigos/en/SelfTraining.png
es: /pseudocodigos/es/SelfTraining.png

source: Self-Training Pseudocode
es: Pseudocódigo de Self-Training

source: It is a co-training algorithm style where unlabelled data is pseudo-labelled for retraining the base classifiers. In this case there are three base classifiers. So that an unlabelled example can be used later for retraining it is necessary that the other two classifiers agree in their prediction of that example (although could be wrong). Each base classifier has its own set with that pseudo-labelled examples. A peculiarity of Tri-Training is that this set is "emptied" at each iteration. This entails that each classifier can pseudo-label the same example multiple times (through iterations).
es: Se trata de un algoritmo de la rama co-training donde datos no etiquetados son pseudo-etiquetados para reentrenar los clasificadores base. En este caso se tienen tres clasificadores base. Para que un ejemplo no etiquetado pueda ser utilizado después para reentrenar es necesario que los otros dos clasificadores coincidan en su predicción (aunque podría ser errónea). Cada uno de los clasificadores base tiene un conjunto propio con los nuevos ejemplos pseudo-etiquetados. Una particularidad de Tri-Training es que este conjunto es "vaciado" en cada iteración. Esto conlleva que cada clasificador puede pseudo-etiquetar un mismo ejemplo varias veces (en distintas iteraciones).

source: The process of continuous retraining is repeated until none of the base classifiers receive new pseudo-labelled examples. This will happen when the error verifications are not met.
es: El proceso de sucesivos reentrenamientos es repetido hasta que ninguno de los clasificadores base reciba nuevos ejemplos pseudo-etiquetados. Esto será cuando las comprobaciones en cuanto al error realizadas no se cumplan.

source: /pseudocodigos/en/TriTraining.png
es: /pseudocodigos/es/TriTraining.png

source: Tri-Training Pseudocode
es: Pseudocódigo de Tri-Training

source: User management
es: Administración de usuarios

source: Total users
es: Usuarios totales

source: Last 7 days uploads
es: Cargas de los últimos 7 días

source: Last 7 days runs
es: Ejecuciones de los últimos 7 días

source: Submit
es: Enviar

source: Admin view
es: Vista de administrador

source: Uploads
es: Ficheros

source: Runs
es: Ejecuciones

source: Log In
es: Iniciar sesión

source: Create account
es: Crear cuenta

source: Personal space
es: Espacio personal

source: This is your personal space.
es: Este es tu espacio personal.

source: Here you can see a summary of your profile.
es: Aquí puedes ver un resumen de tu perfil.

source: In this table, you can observe the files (datasets) that the application has saved. You can choose to run an algorithm with one of them or delete it from the system.
es: En esta tabla puedes observar los ficheros (conjuntos de datos) que la aplicación ha guardado. Puedes elegir ejecutar un algoritmo con uno de ellos o eliminarlo del sistema.

source: Also, you can view the executions you have performed previously. You can rerun any of them, delete them, or check the parameters you used.
es: Del mismo modo, puedes ver las ejecuciones que has realizado anteriormente. Puedes re-ejecutar cualquiera de ellas, eliminarlas o consultar los parámetros que utilizaste.

source: My Profile
es: Mi Perfil

source: Edit profile
es: Editar perfil

source: This is your profile.
es: Este es tu perfil.

source: Here you can modify the basic data of your profile.
es: Aquí puedes modificar los datos básicos de tu perfil.

source: Step
es: Paso

source: Initial Data
es: Datos iniciales

source: The graph is initialized with the set of nodes (one for each entry in the dataset). The matrix of distances is calculated taking into account Euclidean distance.
es: El grafo se inicializa con el conjunto de nodos (uno para cada entrada en el conjunto de datos). La matriz de distancias se calcula teniendo en cuenta la distancia Euclidiana.

source: /pseudocodigos/en/gbili/gbili_0.png
es: /pseudocodigos/es/gbili/gbili_0.png

source: K nearest neighbors
es: K vecinos más cercanos

source: In this step, the K nearest neighbors of each node are calculated taking into account the distance matrix D.
es: En este paso, se calculan los K vecinos más cercanos de cada nodo teniendo en cuenta la matriz de distancias D.

source: /pseudocodigos/en/gbili/gbili_1.png
es: /pseudocodigos/es/gbili/gbili_1.png

source: Mutual K nearest neighbors
es: K vecinos más cercanos mutuos

source: Mutual nearest neighbors are shown, i.e., i is j`s nearest neighbor and j is i`s nearest neighbor.
es: Se muestran los vecinos más cercanos mutuos, es decir, i es el vecino más cercano de j y j es el vecino más cercano de i.

source: /pseudocodigos/en/gbili/gbili_2.png
es: /pseudocodigos/es/gbili/gbili_2.png

source: Minimum distances
es: Distancias mínimas

source: The list of mutual neighbors is traversed and the minimum distance in mutuals neighborhood to a labeled point is calculated.
es: La lista de vecinos mutuos se recorre y se calcula la distancia mínima en el vecindario mutuo a un punto etiquetado.

source: /pseudocodigos/en/gbili/gbili_3.png
es: /pseudocodigos/es/gbili/gbili_3.png

source: Final graph
es: Grafo final

source: Subnetworks or components are distinguished. Nodes will be joined if the component of the node has no labeled data and if any of its neighbors is in a labeled component.
es: Se distinguen subgrafos o componentes. Los nodos se unirán si el componente del nodo no tiene datos etiquetados y si alguno de sus vecinos está en un componente etiquetado.

source: /pseudocodigos/en/gbili/gbili_4.png
es: /pseudocodigos/es/gbili/gbili_4.png

source: In this step, the algorithm is initialized, creating the necessary structures to store data such as nodes, links, kdtree, etc.
es: En este paso, se inicializa el algoritmo, creando las estructuras necesarias para almacenar datos como nodos, enlaces, kdtree, etc.

source: /pseudocodigos/en/rgcli/rgcli_0.png
es: /pseudocodigos/es/rgcli/rgcli_0.png

source: Ke nearest neighbors
es: Ke vecinos más cercanos

source: This method is used to calculate the Ke nearest neighbors using a kdtree and other lists to be used later.
es: Este método se utiliza para calcular los Ke vecinos más cercanos usando un kdtree y otras listas que se utilizarán más tarde.

source: /pseudocodigos/en/rgcli/rgcli_1.png
es: /pseudocodigos/es/rgcli/rgcli_1.png

source: This method is used to calculate the ki neighbors of each node that have the smallest distance to labeled points. For this purpose, the previously calculated list is traversed.
es: Este método se utiliza para calcular los ki vecinos de cada nodo que tienen la menor distancia a los puntos etiquetados. Para este propósito, se recorre la lista calculada previamente.

source: /pseudocodigos/en/rgcli/rgcli_2.png
es: /pseudocodigos/es/rgcli/rgcli_2.png

source: Main visualization
es: Visualización principal

source: Zoom reset
es: Reiniciar Zoom

source: Iteration
es: Iteración

source: Pseudocode
es: Pseudocódigo

source: General statistics
es: Estadísticas generales

source: Initial data
es: Dato inicial

source: Label
es: Etiqueta

source: Classifier
es: Clasificador

source: Classifier: Not classified
es: Clasificador: No clasificado

source: Label: Not classified
es: Etiqueta: No clasificado

source: Measure
es: Valor

source: Point
es: Punto

source: Position
es: Posición

source: overlapping points
es: puntos solapados

source: All
es: Todos

source: None
es: Ninguno

source: Visualization area
es: Área de visualización

source: This page is the heart of the application. Here, you can observe the algorithm training process.
es: Esta página es el núcleo de la aplicación. Aquí podrás observar el proceso de entrenamiento del algoritmo.

source: This is the main chart area.
es: Esta es la zona del gráfico principal.

source: This chart will display the data classified by the algorithm. It's interactive; you can zoom in, scroll around, or select a data point (to display relevant information).
es: En este gráfico se irán mostrando los datos clasificados por el algoritmo. Es interactivo, puedes aplicar zoom, desplazarte o seleccionar un dato (para mostrar información de interés).

source: You can proceed through the algorithm steps manually or automatically while visualizing the events.
es: Puedes avanzar sobre los pasos del algoritmo de forma manual o automática mientras se visualizan los eventos.

source: This is the statistics area.
es: Esta es la zona de estadísticas.

source: Here, the statistics extracted in each iteration are displayed in a general way, as if it were a single model.
es: Aquí se muestran las estadísticas extraídas en cada iteración de forma general, como si fuera un único modelo.

source: Here, the statistics extracted in each iteration for each base classifier are displayed.
es: Aquí se muestran las estadísticas extraídas en cada iteración por cada clasificador base.

source: Through this selector, you can choose the metric you want to see.
es: Mediante este selector puedes elegir la métrica que deseas ver.

source: This allows you to select which base classifier to display.
es: Esto permite seleccionar qué clasificador base mostrar.

source: Specific statistics
es: Estadísticas específicas

source: Infer labels
es: Inferir etiquetas

source: Algorithm Steps
es: Pasos Algoritmo

source: Graph phases
es: Fases de grafos

source: Inference results
es: Resultados de inferencia

source: Confusion matrix
es: Matriz de confusión

source: Dataset is unlabelled so there is no posible evaluation. If there is no label on each data entry, predictions can not be compared.
es: El conjunto de datos no está etiquetado, por lo que no es posible realizar una evaluación. Si no hay una etiqueta en cada entrada de datos, las predicciones no se pueden comparar.

source: Ki nearest neighbors
es: Ki vecinos más cercanos

source: Actual
es: Real

source: Prediction
es: Predicción

source: Accuracy
es: Exactitud

source: Precision
es: Precisión

source: Recall
es: Sensibilidad

source: F1-score
es: Medida-F1

source: True Positive
es: Verdaderos Positivos

source: True Negative
es: Verdaderos Negativos

source: False Positive
es: Falsos Positivos

source: False Negative
es: Falsos Negativos

source: Average results
es: Resultados promedios

source: Class metrics
es: Métricas de clase

source: Average metrics
es: Métricas generales

source: This page is the heart of the application. Here, you can observe graph based algorithm training process.
es: Esta página es el núcleo de la aplicación. Aquí podrás observar el proceso de entrenamiento del algoritmo.

source: This chart will display the graph phases of the algorithm. It's interactive; you can zoom in, scroll around, or select a data point (to display relevant information).
es: En este gráfico se irán mostrando los datos clasificados por el algoritmo. Es interactivo, puedes aplicar zoom, desplazarte o seleccionar un dato (para mostrar información de interés).

source: Here you can see the legend of the graph. Also you can click on each option to see original data.
es: Aquí puedes ver la leyenda del gráfico. También puedes hacer clic en cada opción para ver los datos originales.

source: This is where you can see the steps explained theoretically, plus a summary of results.
es: Aquí es donde puedes ver los pasos explicados teóricamente, además de un resumen de los resultados.

source: You can switch between graph phases and inference results. Initially inference results will be disabled.
es: Puedes alternar entre las fases del grafo y los resultados de inferencia. Inicialmente, los resultados de inferencia estarán deshabilitados.
